Revit 2027 API
BuiltInFailures.CopyMonitorFailures Class
 Failures about CopyWatch.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.CopyMonitorFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class CopyMonitorFailures
Public NotInheritable Class CopyMonitorFailures
public ref class CopyMonitorFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type CopyMonitorFailures = class end
The BuiltInFailures.CopyMonitorFailures type exposes the following members.
Properties
Name | Description
AlreadyCopiedAndStopWatch |  Element has already been copied. Stop existing monitoring to copy again.
AlreadyWatched |  Elements already monitored.
CannotCopyCuttingInsert |  Copy/Monitor does not support cutting inserts in floors. Some openings were not copied.
CannotMoveHostedFixtureViaCopyMonitor |  The fixture is hosted and cannot be moved. Use the Move command to relocate the fixture in the host file as required.
CopyWatchAlert |  Coordination Monitor alert : [Description]
GridDeletedSameName |  Grid cannot be copied because grid with desired name '[Name]' already exist in a target document.
LevelDeletedSameName |  Level cannot be copied because level with desired name '[Name]' already exist in a target document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace